Revit 2026 API

# ItemFactoryBaseNewGroup Method

---
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Group NewGroup(
	ICollection<ElementId> elementIds
)
```
```vb
Public Function NewGroup (
	elementIds As ICollection(Of ElementId)
) As Group
```
```cpp
public:
Group^ NewGroup(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member NewGroup :
        elementIds : ICollection<ElementId> -> Group
```

#### Parameters

elementIds ICollectionElementId

#### Return Value

Group

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace